Revit 2027 API
BuiltInFailures.HostObjFailures Class
 Failures about HostObj.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.HostObjFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class HostObjFailures
Public NotInheritable Class HostObjFailures
public ref class HostObjFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type HostObjFailures = class end
The BuiltInFailures.HostObjFailures type exposes the following members.
Properties
Name | Description
HostMismatch |  Can't use this type in this host.
ReferencesNulled |  One or more references are or have become invalid.
Top
See Also
Reference
Autodesk.Revit.DB Namespace